INERIStest12_casefile/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fields to be probed. runTime modifiable!
fields
(
    alpha.air
    U.air
    U.water
    p	
    T.air	
    T.water 	
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (1.0 0.0 0.0)
    (10.0 0.0 0.0)
    (20.0 0.0 0.0)
    (30.0 0.0 0.0)
    (40.0 0.0 0.0)

    //(0.0762 0.0253 0.0)
    //(0.1016 0.0253 0.0)
    //(0.1270 0.0253 0.0)
    //(0.1524 0.0253 0.0)
    //(0.1778 0.0253 0.0)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
