INERIStest12_casefile/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.153
    
    volScalarFieldValue T.air 289.43
    volScalarFieldValue T.water 289.2078
    volScalarFieldValue p 5230800.0
);

regions
(
    boxToCell
    {
        box (39 -1 -1) (40 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.153 volScalarFieldValue T.air 289.2078
volScalarFieldValue T.water 289.2078 volScalarFieldValue p 5230800.0
        );
    }
);


// ************************************************************************* //
